
#Область КлиентскиеПроцедуры

&НаКлиенте
Процедура SaveToJSON(Команда)
	
	SaveToJSONНаСервере();

КонецПроцедуры

&НаСервере
Процедура SaveToJSONНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");	
	Обработка.ВыгрузитьДанные();

КонецПроцедуры

&НаКлиенте
Процедура ПутьКОбработкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

    ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите каталог'");
    ДиалогВыбораФайла.Фильтр = "Обработка|*.epf";
    Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтаФорма);
    ДиалогВыбораФайла.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

    Если ТипЗнч(ВыбранныеФайлы)=Тип("Массив") Тогда
        Если ВыбранныеФайлы.Количество() > 0 Тогда
            Объект.Каталог = ВыбранныеФайлы.Получить(0);
        КонецЕсли;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

